In [1]:
#ml basic statics
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("income.csv",names=['Name','Income'],skiprows=[0])

In [3]:
#if we open the file from the folder then use the relative path i.e."income.csv"
# if you open the file from the anaconda navigator then we use the absolute path i.e."C:/Data Science/3-Statistics/income.csv"

In [4]:
df.describe()

             Income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [5]:
df.Income.quantile(0.25)

5500.0

In [6]:
df

        Name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [7]:
df.Income.quantile(1)

10000000.0

In [8]:
df.Income.quantile(1)

10000000.0

In [9]:
percentile_99=df.Income.quantile(0.99)
percentile_99

9400479.999999994

In [10]:
percentile_99=df.Income.quantile(0.99)
percentile_99

9400479.999999994

In [11]:
percentile_99=df.Income.quantile(0.99)
percentile_99

9400479.999999994

In [12]:
df_no_outlier=df[df.Income<=percentile_99]

In [13]:
df_no_outlier
# the outlier is remove from the dataset

    Name  Income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [14]:
#day 13/9/23  #it

In [15]:
df['Income'][3]=np.NaN       #putting the value to NaN

C:\Users\suraj\AppData\Local\Temp\ipykernel_26580\2997706020.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Income'][3]=np.NaN       #putting the value to NaN

In [16]:
df

        Name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [17]:
#replace the nan value by median or mean
#repalce the nan value by using the mean value
df_new=df.fillna(df.Income.mean())     #fillnan is methode to replace the NaN value

In [18]:
df_new

        Name        Income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [19]:
df.Income.mean() #find the mean of the dataset

1671666.6666666667

In [20]:
df.Income.median()  # finding the median value of the data set

6500.0

In [21]:
#repalce the nan value by using the mean value
df_new=df.fillna(df.Income.median())